results/results_m5_large/results_m5_large_run3/oltp_read_only_t8/sysbench.log
sysbench 1.1.0-3ceba0b (using bundled LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 8
Report intermediate results every 10 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 10s ] thds: 8 tps: 111.38 qps: 1787.93 (r/w/o: 1564.37/0.00/223.55) lat (ms,95%): 116.80 err/s: 0.00 reconn/s: 0.00
[ 20s ] thds: 8 tps: 112.20 qps: 1795.96 (r/w/o: 1571.55/0.00/224.41) lat (ms,95%): 114.72 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 8 tps: 111.30 qps: 1781.50 (r/w/o: 1558.90/0.00/222.60) lat (ms,95%): 114.72 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 8 tps: 109.20 qps: 1745.90 (r/w/o: 1527.50/0.00/218.40) lat (ms,95%): 121.08 err/s: 0.00 reconn/s: 0.00
[ 50s ] thds: 8 tps: 110.00 qps: 1760.10 (r/w/o: 1540.10/0.00/220.00) lat (ms,95%): 114.72 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 8 tps: 108.30 qps: 1732.70 (r/w/o: 1516.10/0.00/216.60) lat (ms,95%): 118.92 err/s: 0.00 reconn/s: 0.00
[ 70s ] thds: 8 tps: 109.50 qps: 1753.20 (r/w/o: 1534.20/0.00/219.00) lat (ms,95%): 121.08 err/s: 0.00 reconn/s: 0.00
[ 80s ] thds: 8 tps: 111.70 qps: 1786.60 (r/w/o: 1563.20/0.00/223.40) lat (ms,95%): 118.92 err/s: 0.00 reconn/s: 0.00
[ 90s ] thds: 8 tps: 108.80 qps: 1740.70 (r/w/o: 1523.10/0.00/217.60) lat (ms,95%): 121.08 err/s: 0.00 reconn/s: 0.00
[ 100s ] thds: 8 tps: 109.40 qps: 1751.70 (r/w/o: 1532.90/0.00/218.80) lat (ms,95%): 114.72 err/s: 0.00 reconn/s: 0.00
[ 110s ] thds: 8 tps: 109.90 qps: 1754.30 (r/w/o: 1534.50/0.00/219.80) lat (ms,95%): 118.92 err/s: 0.00 reconn/s: 0.00
[ 120s ] thds: 8 tps: 107.40 qps: 1721.51 (r/w/o: 1506.71/0.00/214.80) lat (ms,95%): 125.52 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            184786
        write:                           0
        other:                           26398
        total:                           211184
    transactions:                        13199  (109.96 per sec.)
    queries:                             211184 (1759.35 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

Throughput:
    events/s (eps):                      109.9594
    time elapsed:                        120.0352s
    total number of events:              13199

Latency (ms):
         min:                                   38.04
         avg:                                   72.74
         max:                                  295.56
         95th percentile:                      118.92
         sum:                               960145.49

Threads fairness:
    events (avg/stddev):           1649.8750/15.96
    execution time (avg/stddev):   120.0182/0.01